/*--------------------------------------------------------------------
 *    The MB-system:	mbsys_reson7k.h	3/3/2004
 *	$Id$
 *
 *    Copyright (c) 2004-2014 by
 *    David W. Caress (caress@mbari.org)
 *      Monterey Bay Aquarium Research Institute
 *      Moss Landing, CA 95039
 *    and Dale N. Chayes (dale@ldeo.columbia.edu)
 *      Lamont-Doherty Earth Observatory
 *      Palisades, NY 10964
 *
 *    See README file for copying and redistribution conditions.
 *--------------------------------------------------------------------*/
/*
 * mbsys_reson7k.h defines the MBIO data structures for handling data from
 * Reson 7k series sonars:
 *      MBF_RESON7K1 : MBIO ID 191 - Reson 7K Series sonar
 *
 * Author:	D. W. Caress
 * Date:	March 3, 2004
 *
 * $Log: mbsys_reson7k.h,v $
 * Revision 5.16  2008/09/27 03:27:10  caress
 * Working towards release 5.1.1beta24
 *
 * Revision 5.15  2008/09/20 00:57:41  caress
 * Release 5.1.1beta23
 *
 * Revision 5.14  2008/05/16 22:56:24  caress
 * Release 5.1.1beta18.
 *
 * Revision 5.13  2008/03/01 09:14:03  caress
 * Some housekeeping changes.
 *
 * Revision 5.12  2007/07/03 17:25:50  caress
 * Changes to handle new time lag value in bluefin nav records.
 *
 * Revision 5.11  2006/11/10 22:36:05  caress
 * Working towards release 5.1.0
 *
 * Revision 5.10  2006/09/11 18:55:53  caress
 * Changes during Western Flyer and Thomas Thompson cruises, August-September
 * 2006.
 *
 * Revision 5.9  2006/04/11 19:14:46  caress
 * Various fixes.
 *

#define R7KHDRSIZE_7kPayloadControllerCommand			16
#define R7KHDRSIZE_7kPayloadControllerCommandAcknowledge	12
#define R7KHDRSIZE_7kPayloadControllerStatus			16

/* 11200-11999 reserved for Payload Controller sensor QC records */

/*---------------------------------------------------------------*/

/* Device identifiers */
#define R7KDEVID_GenericPosition	100
#define R7KDEVID_GenericHeading		101
#define R7KDEVID_GenericAttitude	102
#define R7KDEVID_GenericMBES		103
#define R7KDEVID_GenericSidescan	104
#define R7KDEVID_GenericSBP		105
#define R7KDEVID_TrueTime		1001
#define R7KDEVID_CDCSMCG		2000
#define R7KDEVID_CDCSPG			2001
#define R7KDEVID_EmpireMagnetics	2002
#define R7KDEVID_ResonTC4013		4013
#define R7KDEVID_ResonDiverDat		6000
#define R7KDEVID_Reson7kCenter		7000
#define R7KDEVID_Reson7kUserInterface	7001
#define R7KDEVID_ResonPDS2000		7003
#define R7KDEVID_SeaBat7012		7012
#define R7KDEVID_SeaBat7100		7100
#define R7KDEVID_SeaBat7101		7101
#define R7KDEVID_SeaBat7102		7102
#define R7KDEVID_SeaBat7111		7111
#define R7KDEVID_SeaBat7112		7112
#define R7KDEVID_SeaBat7123		7123
#define R7KDEVID_SeaBat7125		7125
#define R7KDEVID_SeaBat7128		7128
#define R7KDEVID_SeaBat7150		7150
#define R7KDEVID_SeaBat7160		7160
#define R7KDEVID_SeaBat8100		8100
#define R7KDEVID_SeaBat8101		8101
#define R7KDEVID_SeaBat8102		8102
#define R7KDEVID_SeaBat8112		8111
#define R7KDEVID_SeaBat8123		8123
#define R7KDEVID_SeaBat8124		8124
#define R7KDEVID_SeaBat8125		8125
#define R7KDEVID_SeaBat8128		8128
#define R7KDEVID_SeaBat8150		8150
#define R7KDEVID_SeaBat8160		8160
#define R7KDEVID_TSSDMS05		10000
#define R7KDEVID_TSS335B		10001
#define R7KDEVID_TSS332B		10002
#define R7KDEVID_SeaBirdSBE37		10010
#define R7KDEVID_Littom200		10020
#define R7KDEVID_EdgetechFSDW		11000
#define R7KDEVID_EdgetechFSDWSBP	11000
#define R7KDEVID_EdgetechFSDWSSLF	11001
#define R7KDEVID_EdgetechFSDWSSHF	11002
#define R7KDEVID_Bluefin		11100
#define R7KDEVID_IfremerTechsas		11200
#define R7KDEVID_SimradRPT319		12000

/*---------------------------------------------------------------*/

/* Edgetech trace data format definitions */
#define	EDGETECH_TRACEFORMAT_ENVELOPE		0 	/* 2 bytes/sample (unsigned) */
#define	EDGETECH_TRACEFORMAT_ANALYTIC		1 	/* 4 bytes/sample (I + Q) */
#define	EDGETECH_TRACEFORMAT_RAW		2 	/* 2 bytes/sample (signed) */
#define	EDGETECH_TRACEFORMAT_REALANALYTIC	3 	/* 2 bytes/sample (signed) */
#define	EDGETECH_TRACEFORMAT_PIXEL		4 	/* 2 bytes/sample (signed) */

/*---------------------------------------------------------------*/

/* Bluefin data frame definitions */
#define	BLUEFIN_MAX_FRAMES			25 	/* Maximum number of Bluefin
								data frames contained
								in a Bluefin data record */

/*---------------------------------------------------------------*/

/* Structure size definitions */
#define	MBSYS_RESON7K_BUFFER_STARTSIZE	32768
#define	MBSYS_RESON7K_MAX_DEVICE	10
#define MBSYS_RESON7K_MAX_RECEIVERS	1024
#define	MBSYS_RESON7K_MAX_BEAMS		512
#define	MBSYS_RESON7K_MAX_PIXELS	4096

typedef struct s7k_time_struct
{
    unsigned short  Year;			/* Year                 u16 0 - 65535 */
    unsigned short  Day;			/* Day                  u16 1 - 366 */

    float           Seconds;			/* Seconds              f32 0.000000 - 59.000000 */

    mb_u_char       Hours;			/* Hours                u8  0 - 23 */
    mb_u_char       Minutes;			/* Minutes              u8  0 - 59 */
}
s7k_time;

typedef struct s7k_header_struct
{
    unsigned short  Version;                    /* Version              u16 Version of this frame (e.g.: 1, 2 etc.) */
    unsigned short  Offset;                     /* Offset               u16 Offset in bytes from the start of the sync
    												pattern to the start of the DATA SECTION.
												This allows for expansion of the header
												whilst maintaining backward compatibility. */

    unsigned int   SyncPattern;			/* Sync pattern         u32 0x0000FFFF */
    unsigned int   Size;			/* Size                 u32 Size in bytes of this record from the start
    												of the version field to the end of the
												Checksum. It includes the embedded data size. */
    unsigned int   OffsetToOptionalData;	/* Data offset          u32 Offset in bytes to optional data field from
    												start of record. Zero implies no optional data. */
    unsigned int   OptionalDataIdentifier;	/* Data idenfitifer     u32 Identifier for optional data field. Zero for
    	`											no optional field. This identifier is
												described with each record type. */
    s7k_time 	   s7kTime;			/* 7KTIME               u8*10   UTC.*/
    unsigned short Reserved;			/* Reserved  */
    unsigned int   RecordType;			/* Record type          u32 Unique identifier of indicating the type of
    												data embedded in this record. */
    unsigned int   DeviceId;			/* Device identifier    u32 Identifier of the device to which this datum pertains. */
    unsigned short Reserved2;			/* Reserved  */
    unsigned short SystemEnumerator;		/* System enumerator	The enumerator is used to differentiate between devices with the
    									same device identifiers in one installation/system. It is up to
									each application to decide what number to populate this field with.  */
    unsigned int   DataSetNumber;		/* Data set             u32 Data set number - OBSOLETE in version 4 header */
    unsigned int   RecordNumber;		/* Record count         u32 Sequential record counter. */

    char           PreviousRecord[8];		/* Previous record      i64 Pointer to the previous record of the same type
    												(in bytes from start of file). This is an
												optional field for files and shall be -1
												if not used.
												- OBSOLETE in version 4 header */
    char           NextRecord[8];		/* Next record          i64 Pointer to the next record of the same type in
    												bytes from start of file. This is an optional
												field for files and shall be -1 if not used.
												- OBSOLETE in version 4 header */

    unsigned short Flags;			/* Flags                u16 BIT FIELD:
    										Bit 0 - Checksum
											0 - invalid checksum
											1 - valid checksum
										Bit 1 - Reserved
										Bit 2 - Fragmentation
											0 - data unfragmented
											1 - fragmented sequence */
    unsigned short Reserved3;			/* Reserved  */
    unsigned int Reserved4;			/* Reserved  		- NEW in version 4 header */
    unsigned int FragmentedTotal;		/* Total Fragmented	Total records in fragmented data record set (if flag is set) - NEW in version 4 header */
    unsigned int FragmentNumber;		/* Fragment number	Fragment number (if flag is set) - NEW in version 4 header */

    /* Following this header is:
    	DATA SECTION							xx  Dynamic Record type specific data.
    	Checksum							u32 Sum of bytes in data section
										(optional, depends on bit 1 of Flags field).
										Note: the checksum field  should be computed
										as a 64 bit unsigned integer  with the least
										significant 32 bits used to populate  this field
										thus ensuring a valid checksum and  avoiding
										an explicit overflow.  */
}
s7k_header;

/* Reference point information (record 1000) */
/*  Note: these offsets should be zero for submersible vehicles */
typedef struct s7kr_reference_struct
{
	s7k_header	header;
	float		offset_x;		/* Vehicle's X reference point ot center of gravity (meters) */
	float		offset_y;		/* Vehicle's Y reference point ot center of gravity (meters) */
	float		offset_z;		/* Vehicle's Z reference point ot center of gravity (meters) */
	float		water_z;		/* Vehicle's water level to center of gravity (meters) */
}
s7kr_reference;

/* Sensor uncalibrated offset position information (record 1001) */
typedef struct s7kr_sensoruncal_struct
{
	s7k_header	header;
	float		offset_x;		/* Sensor X offset from vehicle reference point (meters) */
	float		offset_y;		/* Sensor Y offset from vehicle reference point (meters) */
	float		offset_z;		/* Sensor Z offset from vehicle reference point (meters) */
	float		offset_roll;		/* Sensor roll offset (radians - port up is positive) */
	float		offset_pitch;		/* Sensor pitch offset (radians - bow up is positive) */
	float		offset_yaw;		/* Sensor yaw offset (radians - bow right is positive) */
}
s7kr_sensoruncal;

/* Sensor calibrated offset position information (record 1002) */
typedef struct s7kr_sensorcal_struct
{
	s7k_header	header;
	float		offset_x;		/* Sensor X offset from vehicle reference point (meters) */
	float		offset_y;		/* Sensor Y offset from vehicle reference point (meters) */
	float		offset_z;		/* Sensor Z offset from vehicle reference point (meters) */
	float		offset_roll;		/* Sensor roll offset (radians - port up is positive) */
	float		offset_pitch;		/* Sensor pitch offset (radians - bow up is positive) */
	float		offset_yaw;		/* Sensor yaw offset (radians - bow right is positive) */
}
s7kr_sensorcal;

/* Position (record 1003) */
typedef struct s7kr_position_struct
{
	s7k_header	header;
	unsigned int	datum;			/* 0=WGS84; others not yet defined */
	float		latency;		/* Position sensor time latency (seconds) */
	double		latitude;		/* Latitude (radians) */
	double		longitude;		/* Longitude (radians) */
	double		height;			/* Height relative to datum (meters) */
	mb_u_char	type;			/* Position type flag:
							0: Geographical coordinates
							1: Grid coordinates */
	mb_u_char	utm_zone;		/* UTM zone */
	mb_u_char	quality;		/* Quality flag
							0: Navigation data
							1: Dead reckoning */
	mb_u_char	method;			/* Positioning method
							0: GPS
							1: DGPS
							2: Start of inertial positioning system from GPS
							3: Start of inertial positioning system from DGPS
							4: Start of inertial positioning system from bottom correlation
							5: Start of inertial positioning system from bottom object
							6: Start of inertial positioning system from inertial positioning
							7: Start of inertial positioning system from optional data
							8: Stop of inertial positioning system from GPS
							9: Stop of inertial positioning system from DGPS
							10: Stop of inertial positioning system from bottom correlation
							11: Stop of inertial positioning system from bottom object
							12: Stop of inertial positioning system from inertial positioning
							13: Stop of inertial positioning system from optional data
							14: Optional data
							>14: Reserved */
}
s7kr_position;

/* Custom attitude (record 1004) */
typedef struct s7kr_customattitude_struct
{
	s7k_header	header;
	mb_u_char	bitfield;		/* Boolean bitmask indicating which attitude fields are in data
								0: pitch (radians - float)
								1: roll (radians - float)
								2: heading (radians - float)
								3: heave (meters - float)
								4-7: reserved */
	mb_u_char	reserved;		/* reserved field */
	unsigned short	n;			/* number of fields */
	float		frequency;		/* sample rate (samples/second) */
	int		nalloc;			/* number of samples allocated */
	float		*pitch;
	float		*roll;
	float		*heading;
	float		*heave;
	float		*pitchrate;
	float		*rollrate;
	float		*headingrate;
	float		*heaverate;
}
s7kr_customattitude;

/* Tide (record 1005) */
typedef struct s7kr_tide_struct
{
	s7k_header	header;
	float		tide;			/* height correction above mean sea level (meters) */
	unsigned short	source;			/* tide data source: 0 - table; 1- gauge */
	mb_u_char	flags;			/* Gauge and position validity flags
							Bit 0: 0/1 for gauge id valid/invalid
							Bit 1: 0/1 for position valid/invalid */
	unsigned short	gauge;			/* Optional field to permit discrimination
							between different devices */
	unsigned int	datum;			/* 0=WGS84; others not yet defined */
	float		latency;		/* Position sensor time latency (seconds) */
	double		latitude;		/* Latitude (radians) */
	double		longitude;		/* Longitude (radians) */
	double		height;			/* Height relative to datum (meters) */
	mb_u_char	type;			/* Position type flag:
							0: Geographical coordinates
							1: Grid coordinates */
	mb_u_char	utm_zone;		/* UTM zone */
}
s7kr_tide;

/* Altitude (record 1006) */
typedef struct s7kr_altitude_struct
{
	s7k_header	header;
	float		altitude;		/* altitude above seafloor (meters) */
}
s7kr_altitude;

/* Motion over ground (record 1007) */
typedef struct s7kr_motion_struct
{
	s7k_header	header;
	mb_u_char	bitfield;		/* Boolean bitmask indicating which motion over ground fields are in data
							0: X,Y,Z speed (m/s - 3 X float)
							1: X,Y,Z acceleration (m/s**2 - 3 X float)
							2-7: reserved */
	mb_u_char	reserved;		/* reserved field */
	unsigned short	n;			/* number of fields */
	float		frequency;		/* sample rate (samples/second) */
	int		nalloc;			/* number of samples allocated */
	float		*x;
	float		*y;
	float		*z;
	float		*xa;
	float		*ya;
	float		*za;
}
s7kr_motion;

/* Depth (record 1008) */
typedef struct s7kr_depth_struct
{
	s7k_header	header;
	mb_u_char	descriptor;		/* Depth descriptor:
							0 = depth to sensor
							1 = water depth */
	mb_u_char	correction;		/* Correction flag:
							0 = raw depth as measured
							1 = corrected depth (relative to mean sea level) */
	unsigned short	reserved;		/* reserved field */
	float		depth;			/* depth (meters) */
}
s7kr_depth;

/* Sound velocity profile (record 1009) */
typedef struct s7kr_svp_struct
{
	s7k_header	header;
	mb_u_char	position_flag;		/* Position validity flag:
							0: invalid position fields
							1: valid position field */
	mb_u_char	reserved1;		/* reserved field */
	unsigned short	reserved2;		/* reserved field */
	double		latitude;		/* Latitude (radians) */
	double		longitude;		/* Longitude (radians) */
	unsigned int	n;			/* number of fields */
	int		nalloc;			/* number of samples allocated */
	float		*depth;			/* depth (meters) */
	float		*sound_velocity;	/* sound velocity (meters/second) */
}
s7kr_svp;

/* CTD (record 1010) */
typedef struct s7kr_ctd_struct
{
	s7k_header	header;
	float		frequency;		/* Sample rate */
	mb_u_char	velocity_source_flag;	/* Velocity source flag:
							0: not computed
							1: CTD
							2: user computed */
	mb_u_char	velocity_algorithm;	/* Velocity algorithm flag:
							0: not computed
							1: Checn Millero
							2: Delgrosso */
	mb_u_char	conductivity_flag;	/* Conductivity flag:
							0: conductivity
							1: salinity */
	mb_u_char	pressure_flag;		/* Pressure flag:
							0: pressure
							1: depth */
	mb_u_char	position_flag;		/* Position validity flag:
							0: invalid position fields
							1: valid position field */
	mb_u_char	validity;		/* Sample content validity:
							Bit 0: conductivity/salinity
							Bit 1: water temperature
							Bit 2: pressure/depth
							Bit 3: sound velocity
							Bit 4: absorption */
	unsigned short	reserved;		/* Reserved field */
	double		latitude;		/* Latitude (radians) */
	double		longitude;		/* Longitude (radians) */
	float		sample_rate;		/* Sample rate */
	unsigned int	n;			/* Number of fields */
	int		nalloc;			/* Number of samples allocated */
	float		*conductivity_salinity;	/* Conductivity (s/m) or salinity (ppt) */
	float		*temperature;		/* Temperature (degrees celcius) */
	float		*pressure_depth;	/* Pressure (pascals) or depth (meters) */
	float		*sound_velocity;	/* Sound velocity (meters/second) */
	float		*absorption;		/* Sound velocity absorption (dB/second) */
}
s7kr_ctd;

/* Geodesy (record 1011) */
typedef struct s7kr_geodesy_struct
{
	s7k_header	header;
	char		spheroid[32];		/* Text description of the spheroid name (e.g. "WGS84") */
	double		semimajoraxis;		/* Semi-major axis in meters (e.g. 6378137.0 for WGS84) */
	double		flattening;		/* Inverse flattening in meters (e.g. 298.257223563 for WGS84) */
	char		reserved1[16];		/* Reserved space */
	char		datum[32];		/* Datum name (e.g. "WGS84") */
	unsigned int	calculation_method;	/* Data calculation method:
							0 - Molodensky
							1 - Bursa / Wolfe
							2 - DMA MRE
							3 - NADCON
							4 - HPGN
							5 - Canadian National Transformation V2 */
	unsigned int	number_parameters;	/* Seven parameter transformation supported */
	double		dx;			/* X shift (meters) */
	double		dy;			/* Y shift (meters) */
	double		dz;			/* Z shift (meters) */
	double		rx;			/* X rotation (degrees) */
	double		ry;			/* Y rotation (degrees) */
	double		rz;			/* Z rotation (degrees) */
	double		scale;			/* Scale */
	char		reserved2[35];		/* Reserved for implementation of 9 parameter transformation */
	char		grid_name[32];		/* Name of grid system in use: (e.g. "UTM") */
	mb_u_char	distance_units;		/* Grid distance units:
							0 - meters
							1 - feet
							2 - yards
							3 - US survey feet
							4 - km
							5 - miles
							6 - US survey miles
							7 - nautical miles
							8 - chains
							9 - links */
	mb_u_char	angular_units;		/* Grid angulat units:
							0 - radians
							1 - degrees
							2 - degrees, minutes, seconds
							3 - gradians
							4 - arc-seconds */
	double		latitude_origin;	/* Latitude of origin */
	double		central_meriidan;	/* Central meridian */
	double		false_easting;		/* False easting (meters) */
	double		false_northing;		/* False northing */
	double		central_scale_factor;	/* Central scale factor */
	int		custum_identifier;	/* Identifier for optional field definition in 7k record.
							Used to define projection specific parameters.
							-2 - custom
							-1 - not used */
	char		reserved3[50];		/* Reserved field */
}
s7kr_geodesy;

/* Roll pitch heave (record 1012) */
typedef struct s7kr_rollpitchheave_struct
{
	s7k_header	header;
	float		roll;			/* Roll (radians) */
	float		pitch;			/* Pitch (radians) */
	float		heave;			/* Heave (m) */
}
s7kr_rollpitchheave;

/* Heading (record 1013) */
typedef struct s7kr_heading_struct
{
	s7k_header	header;
	float		heading;		/* Heading (radians) */
}
s7kr_heading;

/* Survey Line (record 1014) */
typedef struct s7kr_surveyline_struct
{
	s7k_header	header;
	unsigned short	n;			/* Number of points */
	unsigned short	type;			/* Position type flag:
							0: Geographical coordinates
							1: Grid coordinates */
	float		turnradius;		/* Turn radius between line segments
							(meters, 0 = no curvature in turns) */
	char		name[64];		/* Line name */
	int		nalloc;			/* Number of points allocated */
	double		*latitude;		/* Latitude (radians, -pi/2 to pi/2) */
	double		*longitude;		/* Longitude (radians -pi to pi) */
}
s7kr_surveyline;

/* Navigation (record 1015) */
typedef struct s7kr_navigation_struct
{
	s7k_header	header;
	mb_u_char	vertical_reference;	/* Vertical reference:
							1 = Ellipsoid
							2 = Geoid
							3 = Chart datum */
	double		latitude;		/* Latitude (radians, -pi/2 to pi/2) */
	double		longitude;		/* Longitude (radians -pi to pi) */
	float		position_accuracy;	/* Horizontal position accuracy (meters) */
	float		height;			/* Height of vessel reference point above
							vertical reference (meters) */
	float		height_accuracy;	/* Height accuracy (meters) */
	float		speed;			/* Speed over ground (meters/sec) */
	float		course;			/* Course over ground (radians) */
	float		heading;		/* Heading (radians) */
}
s7kr_navigation;

/* Attitude (record 1016) */
typedef struct s7kr_attitude_struct
{
	s7k_header	header;
	mb_u_char	n;			/* number of datasets */
	int		nalloc;			/* number of samples allocated */
	unsigned short	*delta_time;		/* Time difference with record timestamp (msec) */
	float		*roll;			/* Roll (radians) */
	float		*pitch;			/* Pitch (radians) */
	float		*heave;			/* Heave (m) */
	float		*heading;		/* Heading (radians) */
}
s7kr_attitude;

/* Unknown record 1022 (record 1022) */
typedef struct s7kr_rec1022_struct
{
	s7k_header	header;
	mb_u_char	data[R7KHDRSIZE_Rec1022];/* raw bytes in unknown record */
}
s7kr_rec1022;

/* Edgetech sidescan or subbottom channel header data */
typedef struct s7k_fsdwchannel_struct
{
	mb_u_char	number;			/* Channel number (0 to number channels - 1) */
	mb_u_char	type;			/* Channel type:
								0 - port
								1 - starboard */
	mb_u_char	data_type;		/* Channel data type:
								0 - slant range
								1 - ground range */
	mb_u_char	polarity;		/* Channel polarity
								0 - bipolar
								1 - unipolar */
	mb_u_char	bytespersample;		/* Bytes per sample of the imagery */
	char		reserved1[3];		/* Reserved */
	unsigned int	number_samples;		/* Number of samples in this channel */
	unsigned int	start_time;		/* Start of first sample in microseconds relative
								to the ping time stamp */
	unsigned int	sample_interval;		/* Data sample interval in microseconds */
	float		range;			/* Slant range or ground range in meters and
								depends on the data type field above */
	float		voltage;			/* Analogue maximum amplitude. Should be -1 if not used */
	char		name[16];		/* Channel name */
	char		reserved2[20];		/* Reserved */
	int		data_alloc;		/* number of bytes allocated for data array */
	char		*data;
}
s7k_fsdwchannel;

/* Edgetech sidescan header data */
typedef struct s7k_fsdwssheader_struct
{
unsigned short subsystem;		/*   0 -   1 : Subsystem (0 .. n) */
unsigned short channelNum;		/*   2 -   3 : Channel Number (0 .. n) */
unsigned int pingNum;			/*   4 -   7 : Ping number (increments with ping) */
unsigned short packetNum;		/*   8 -   9 : Packet number (1..n) Each ping starts with packet 1 */
unsigned short trigSource;		/*  10 -  11 : TriggerSource (0 = internal, 1 = external) */
unsigned int samples;			/*  12 -  15 : Samples in this packet */
unsigned int sampleInterval;		/*  16 -  19 : Sample interval in ns of stored data */
unsigned int startDepth;		/*  20 -  23 : starting Depth (window offset) in samples */
short weightingFactor;			/*  24 -  25 : -- defined as 2 -N volts for lsb */
unsigned short ADCGain;			/*  26 -  27 : Gain factor of ADC */
unsigned short ADCMax;			/*  28 -  29 : Maximum absolute value for ADC samples for this packet */
unsigned short rangeSetting;		/*  30 -  31 : Range Setting (meters X 10) */
unsigned short pulseID;			/*  32 -  33 : Unique pulse identifier */
unsigned short markNumber;		/*  34 -  35 : Mark Number (0 = no mark) */
unsigned short dataFormat;		/*  36 -  37 : Data format */
					/*   0 = 1 short  per sample  - envelope data */
					/*   1 = 2 shorts per sample  - stored as real(1), imag(1), */
					/*   2 = 1 short  per sample  - before matched filter (raw) */
					/*   3 = 1 short  per sample  - real part analytic signal */
					/*   NOTE: For type = 1, the total number of bytes of data to follow is */
					/*   4 * samples.  For all other types the total bytes is 2 * samples */
unsigned short reserved;		/*  38 -  39 : Reserved field to round up to a 32-bit word boundary */
/* -------------------------------------------------------------------- */
/* computer date / time data acquired                                   */
/* -------------------------------------------------------------------- */
unsigned int millisecondsToday;		/*  40 -  43 : Millieconds today */
short year;				/*  44 -  45 : Year */
unsigned short day;			/*  46 -  47 : Day of year (1 - 366) */
unsigned short hour;			/*  48 -  49 : Hour of day (0 - 23) */
unsigned short minute;			/*  50 -  51 : Minute (0 - 59) */
unsigned short second;			/*  52 -  53 : Second (0 - 59) */
/* -------------------------------------------------------------------- */
/* Auxillary sensor information */
/* -------------------------------------------------------------------- */
short heading;				/*  54 -  55 : Compass heading (minutes) */
short pitch;				/*  56 -  57 : Pitch (minutes) */
short roll;				/*  58 -  59 : Roll (minutes) */
short heave;				/*  60 -  61 : Heave (centimeters) */
short yaw;				/*  62 -  63 : Yaw (minutes) */
unsigned int depth;			/*  64 -  67 : Vehicle depth (centimeters) */
short temperature;			/*  68 -  69 : Temperature (degrees Celsius X 10) */
char reserved2[2];			/*  70 -  71 : Reserved for future use */
int longitude;				/*  72 -  75 : 0.01 Longitude (arc sec) - Reserved for future use by Edgetech */
int latitude;				/*  76 -  79 : 0.01 Latitude (arc sec) - Reserved for future use by Edgetech */
}
s7k_fsdwssheader;

/* Edgetech segy header data */
typedef struct s7k_fsdwsegyheader_struct
{
int sequenceNumber; 			/* 0-3 : Trace Sequence Number (always 0) ** */
unsigned int startDepth;          	/* 4-7 : Starting depth (window offset) in samples. */
unsigned int pingNum;              	/* 8-11: Ping number (increments with ping) ** */
unsigned int channelNum;           	/* 12-15 : Channel Number (0 .. n) ** */
short unused1[6];          		/* 16-27 */

short traceIDCode;         		/* 28-29 : ID Code (always 1 => seismic data) ** */

short unused2[2];     			/* 30-33 */
short dataFormat;			/* 34-35 : DataFormatType */
					/*   0 = 1 short  per sample  - envelope data */
					/*   1 = 2 shorts per sample, - stored as real(1), imag(1), */
					/*   2 = 1 short  per sample  - before matched filter */
					/*   3 = 1 short  per sample  - real part analytic signal */
